emacs/.config/emacs/Config.org
#+title: Emacs configuration 
#+author: Paolo Galletta
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el
* Optimizations
** Garbage collector
#+begin_src emacs-lisp
(setq gc-cons-threshold (* 50 1000 1000))
#+end_src
* Temporary
#+begin_src emacs-lisp
  (defun efs/display-startup-time ()
  (message "Emacs loaded in %s with %d garbage collections."
           (format "%.2f seconds"
                   (float-time
                   (time-subtract after-init-time before-init-time)))
           gcs-done))

(add-hook 'emacs-startup-hook #'efs/display-startup-time)

#+end_src
* General UI
** Basic UI inhibitions
#+begin_src emacs-lisp
  (setq inhibit-startup-message t)
  (scroll-bar-mode -1)        ; Disable visible scrollbar
  (tool-bar-mode -1)          ; Disable the toolbar
  (tooltip-mode -1)           ; Disable tooltips
  (set-fringe-mode 10)        ; Give some breathing room

  (menu-bar-mode -1)            ; Disable the menu bar


  (column-number-mode 1)         ;; Show column number on mode line

  ;; Tabs to spaces
  (setq-default indent-tabs-mode nil
  	      tab-width 2)
(setq visible-bell 1)
#+end_src
** Line numbers in programming mode
#+begin_src emacs-lisp
  (defun glz/prog-mode-configs ()
    "Personal adjustments for programming modes"
    ; Display line numbers
    (display-line-numbers-mode)
    ; Set them as relative numbers
    (setq display-line-numbers 'relative))

  ;; Add hook to all programming mode to satisfy my customizations
  (add-hook 'prog-mode-hook #'glz/prog-mode-configs)
#+end_src
** Fonts
#+begin_src emacs-lisp

  ; (set-face-attribute 'default nil :font "Fira Code Retina" :height 280)

#+end_src emacs-lisp
* Keybindings
** Global Keybindings
#+begin_src emacs-lisp
  ;; Make ESC quit prompts instead of counting as chord
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
#+end_src
** General (Advanced keymapping)
#+begin_src emacs-lisp
  ;; General for unified way of defining keymaps (with additional features)
  (use-package general
    :after evil
    :config
    (general-evil-setup t)
    (general-auto-unbind-keys)
    (general-create-definer glz/leader-key
      :states '(normal insert visual emacs)
      :keymaps 'override
      :prefix "SPC"
      :global-prefix "C-SPC")
    (glz/leader-key
      ; Fast shortcuts
      "." '("Find file in current directory" . counsel-find-file)
      ; Git group
      "g" '(:ignore t :which-key "git"); how to define groups of keymaps, not bound directly to commands
      "gg" '("Open Magit" . magit-status)
      ; Projectile group
      "p" '(:package projectile :keymap projectile-command-map :which-key "projectile") ; How to assign a prefix to existin map      ; Buffers group
      "b" '(:ignore t :which-key "buffers")
      "bb" '("Switch buffers" . counsel-switch-buffer)
      "h" '(:package help :keymap help-map :which-key "help") ; How to assign a prefix to existin map      ; Buffers group
      ))
#+end_src
* Package management settings
#+begin_src emacs-lisp
  ;; Initialize package sources
  (require 'package)

  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                           ("org" . "https://orgmode.org/elpa/")
                           ("elpa" . "https://elpa.gnu.org/packages/")))
  (package-initialize)
  (unless package-archive-contents
   (package-refresh-contents))

  ;; Initialize use-package on non-Linux platforms
  (unless (package-installed-p 'use-package)
     (package-install 'use-package))

  (require 'use-package) ; Package manager
  (setq use-package-always-ensure t)
#+end_src

* Theming
#+begin_src emacs-lisp
  (use-package doom-themes
    :config
    (load-theme 'doom-dracula t))

#+end_src

* Packages
** Ivy (completion backend)
#+begin_src emacs-lisp
  ; Set of tools for better completion on emacs
  (use-package ivy
    :diminish                       ; Prevents to appear on the linemode
    :bind (("C-s" . swiper)
           :map ivy-minibuffer-map
           ("TAB" . ivy-alt-done)	
           ("C-l" . ivy-alt-done)
           ("C-j" . ivy-next-line)
           ("C-k" . ivy-previous-line)
           :map ivy-switch-buffer-map
           ("C-k" . ivy-previous-line)
           ("C-l" . ivy-done)
           ("C-d" . ivy-switch-buffer-kill)
           :map ivy-reverse-i-search-map
           ("C-k" . ivy-previous-line)
           ("C-d" . ivy-reverse-i-search-kill))
    :config
    (ivy-mode 1))

#+end_src
** Counsel (search engine with ivy backend)
#+begin_src emacs-lisp

  ;; Better Emacs function search (fuzzy search, ...)
  (use-package counsel
    :bind (("M-x" . counsel-M-x)
           ("C-x b" . counsel-ibuffer)
           ("C-x C-f" . counsel-find-file)
           :map minibuffer-local-map
           ("C-r" . 'counsel-minibuffer-history))
    :config
    (setq ivy-initial-inputs-alist nil)) ; Remove the starting^


  #+end_src

** Swiper (search engine)
  #+begin_src emacs-lisp
  (use-package swiper)

#+end_src

** Ivy rich (verbose information)

#+begin_src emacs-lisp

  ;; Better completion with more details (function descriptions, ...)
  (use-package ivy-rich
    :init
    (ivy-rich-mode 1))
#+end_src

** Doom modeline (fancy modeline)

#+begin_src emacs-lisp
  (use-package all-the-icons)
  (use-package doom-modeline
    :ensure t
    :init (doom-modeline-mode 1)
    :custom ((doom-modeline-height 15)))`

  (custom-set-variables
   ;; custom-set-variables was added by Custom.
   ;; If you edit it by hand, you could mess it up, so be careful.
   ;; Your init file should contain only one such instance.
   ;; If there is more than one, they won't work right.
   '(package-selected-packages nil))

  (custom-set-faces
   ;; custom-set-faces was added by Custom.
   ;; If you edit it by hand, you could mess it up, so be careful.
   ;; Your init file should contain only one such instance.
   ;; If there is more than one, they won't work right.
   )
#+end_src
** Which + Helpful ( describe keymap + better documentation)
#+begin_src emacs-lisp
;; Helper for the key bindings
(use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config (setq which-key-idle-delay 0.3))



;; Better help screen
(use-package helpful
  :custom                        ; Set variable of customizable variables
  (counsel-describe-function-function #'helpful-callable)    ; set counsel help variables to helpful
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function] . counsel-describe-function)    ; remap exiting keys to new function
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))
#+end_src
** Rainbow delimiters
#+begin_src emacs-lisp
  ;; Color parenthesis
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode)) 

#+end_src

** Evil (Emacs Vi Layer - vim keybindings)
#+begin_src emacs-lisp
  ;; Going evil
  (use-package evil
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-want-C-u-scroll t)
    (setq evil-want-C-i-jump nil)
    ;:hook (evil-mode . rune/evil-hook)
    :config
    (evil-mode 1)
    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
    (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

    ;; Use visual line motions even outside of visual-line-mode buffers
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line) ; if you have lines wrapped around, pressing J K moves to next visual line and not next actual line 

    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal))

  ;; For the parts of emacs not covered by Evil already
  (use-package evil-collection
    :after evil
    :config
    (evil-collection-init))
  (custom-set-variables
   ;; custom-set-variables was added by Custom.
   ;; If you edit it by hand, you could mess it up, so be careful.
   ;; Your init file should contain only one such instance.
   ;; If there is more than one, they won't work right.
   '(package-selected-packages
     '(all-the-icons counsel counsel-projectile doom-modeline doom-themes
                     evil-collection evil-magit forge general helpful
                     ivy-rich magit org-bullets projectile
                     rainbow-delimiters visual-fill-column)))

 #+end_src

** Projectile (project management)

 #+begin_src emacs-lisp

     ;; Project tile for managing projects 
     (use-package projectile
       :diminish projectile-mode
       :config (projectile-mode)
       :custom ((projectile-completion-system 'ivy)) ; Use ivy also in projectile
       ;:bind-keymap
       ;("C-c p" . projectile-command-map)
       )
     ;; Integrate the better completion framework counsel and ivy into projectile
     (use-package counsel-projectile
      :after projectile
      :config
      (counsel-projectile-mode 1))

#+end_src

** Magit (git client)
#+begin_src emacs-lisp
  ;; Magit git client
  (use-package magit
    :commands (magit-status magit-get-current-branch)
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

#+end_src

*** Forge (integration with merge requests, issues, ...)
#+begin_src emacs-lisp
  ;; To integrate issues, merge requests, ...
  (use-package forge)

#+end_src

** Ediff settings
#+begin_src emacs-lisp
  (setq ediff-keep-variants nil)
  (setq ediff-make-buffers-readonly-at-startup nil)
  (setq ediff-merge-revisions-with-ancestor t)
  (setq ediff-show-clashes-only t)

  (setq ediff-split-window-function 'split-window-horizontally)
  (setq ediff-window-setup-function 'ediff-setup-windows-plain)
#+end_src

* Org mode
** Automatic Tangle
#+begin_src emacs-lisp
;; Automatically tangle our Emacs.org config file when we save it
(defun glz/org-babel-tangle-config ()
  (when (string-equal (buffer-file-name)
                      (expand-file-name "~/.dotfiles/emacs/.config/emacs/Config.org"))
    ;; Dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'glz/org-babel-tangle-config)))
#+end_src
** UI Basic UI settings
#+begin_src emacs-lisp
  ;; Org mode settings
  (defun glz/org-mode-setup ()
    (org-indent-mode)             ; Appearence settings
    (variable-pitch-mode 1)       ; 
    (auto-fill-mode 0)
    (visual-line-mode 1)
    (setq evil-auto-indent nil))

  (use-package org
    :hook (org-mode . glz/org-mode-setup)
    :config
    (setq org-ellipsis " ▾" ; Substitute the "..." with this symbol
          org-hide-emphasis-markers t))

  (use-package org-bullets
    :after org
    :hook (org-mode . org-bullets-mode)
    :custom
    (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●"))) ; Custom property lets yopu do key value pairs, the :config instead lets you put code inside, so you need to set properties with setq for instance

  ;; Replace list hyphen with dot
  (font-lock-add-keywords 'org-mode
                          '(("^ *\\([-]\\) "
                            (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))


  ;(dolist (face '((org-level-1 . 1.2) ; This is somehow not working
  ;                (org-level-2 . 1.1)
  ;                (org-level-3 . 1.05)
  ;                (org-level-4 . 1.0)
  ;                (org-level-5 . 1.1)
  ;                (org-level-6 . 1.1)
  ;                (org-level-7 . 1.1)
  ;                (org-level-8 . 1.1)))
  ;    (set-face-attribute (car face) nil :font "Cantarell" :weight 'regular :height (cdr face)))

  ;; Make sure org-indent face is available
  (require 'org-indent)

  ;; Ensure that anything that should be fixed-pitch in Org files appears that way
  (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-indent nil :inherit '(org-hide fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)

  (defun glz/org-mode-visual-fill ()
    (setq visual-fill-column-width  150
          visual-fill-column-center-text t)
    (visual-fill-column-mode 1))

  (use-package visual-fill-column
    :hook (org-mode . glz/org-mode-visual-fill))

#+end_src

** Org tempo (snippets)

#+begin_src emacs-lisp
  ; Org Tempo to have snippets
  (require 'org-tempo)

  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))

 #+end_src
** Org directories

 #+begin_src emacs-lisp
  ;; Org notes directories
  (setq org-directory "/home/pool/Documents/PKDB_Org/") 

   ;; Org agenda 
  (setq org-agenda-files '("Tasks.org" "Birthdays.org" "Calendar.org")) 

#+end_src

** Task Management
*** Org agenda settings
#+begin_src emacs-lisp
   
   (setq org-agenda-start-with-log-mode t) ; Show the log of when tasks have been completed in the agenda
   (setq org-log-done 'time) ; What to log when task is done (in this case, time)
   (setq org-log-into-drawer t) ; Add collapsible section for the logging properties
   ;; Org Agenda Custom views
   ;; Configure custom agenda views
   (setq org-agenda-custom-commands
     '(("d" "Dashboard"
        ((agenda "" ((org-deadline-warning-days 7)))
         (todo "NEXT"
           ((org-agenda-overriding-header "Next Tasks")))
         (tags-todo "agenda/ACTIVE" ((org-agenda-overriding-header "Active Projects")))))

       ("n" "Next Tasks"
        ((todo "NEXT"
           ((org-agenda-overriding-header "Next Tasks")))))


       ("W" "Work Tasks" tags-todo "+work")

       ;; Low-effort next actions
       ("e" tags-todo "+TODO=\"NEXT\"+Effort<15&+Effort>0"
        ((org-agenda-overriding-header "Low Effort Tasks")
         (org-agenda-max-todos 20)
         (org-agenda-files org-agenda-files)))

       ("w" "Workflow Status"
        ((todo "WAIT"
               ((org-agenda-overriding-header "Waiting on External")
                (org-agenda-files org-agenda-files)))
         (todo "REVIEW"
               ((org-agenda-overriding-header "In Review")
                (org-agenda-files org-agenda-files)))
         (todo "PLAN"
               ((org-agenda-overriding-header "In Planning")
                (org-agenda-todo-list-sublevels nil)
                (org-agenda-files org-agenda-files)))
         (todo "BACKLOG"
               ((org-agenda-overriding-header "Project Backlog")
                (org-agenda-todo-list-sublevels nil)
                (org-agenda-files org-agenda-files)))
         (todo "READY"
               ((org-agenda-overriding-header "Ready for Work")
                (org-agenda-files org-agenda-files)))
         (todo "ACTIVE"
               ((org-agenda-overriding-header "Active Projects")
                (org-agenda-files org-agenda-files)))
         (todo "COMPLETED"
               ((org-agenda-overriding-header "Completed Projects")
                (org-agenda-files org-agenda-files)))
         (todo "CANC"
               ((org-agenda-overriding-header "Cancelled Projects")
                (org-agenda-files org-agenda-files)))))))

#+end_src

*** Task keywords and states
#+begin_src emacs-lisp
  ; Org TODO states
  (setq org-todo-keywords
    '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d!)")
      (sequence "IDEA(i)" "DISCUSSION(d)" "ANALYSIS(a)" "IN WORK(w)" "|" "DONE(d!)" "CANCELLED(c!)")))

#+end_src

*** Refiling (moving headings / tasks from one file to another)
#+begin_src emacs-lisp

  ;; Refiling move stuff from one heading to another possibly in another file
  (setq org-refile-targets
        '(("Archive.org" :maxlevel . 1)))

  ;; Save Org buffers after refiling!
  (advice-add 'org-refile :after 'org-save-all-org-buffers)

  #+end_src
  
** Capture templates
  
  #+begin_src emacs-lisp

    ; Taken from Systems crafters, please adapt it to needs and check the docu
    (setq org-capture-templates
      `(("t" "Tasks / Projects")
        ("tt" "Task" entry (file+olp "~/Projects/Code/emacs-from-scratch/OrgFiles/Tasks.org" "Inbox")
             "* TODO %?\n  %U\n  %a\n  %i" :empty-lines 1)
        ("ts" "Clocked Entry Subtask" entry (clock)
             "* TODO %?\n  %U\n  %a\n  %i" :empty-lines 1)

        ("j" "Journal Entries")
        ("jj" "Journal" entry
             (file+olp+datetree "~/Projects/Code/emacs-from-scratch/OrgFiles/Journal.org")
             "\n* %<%I:%M %p> - Journal :journal:\n\n%?\n\n"
             :clock-in :clock-resume
             :empty-lines 1)
        ("jm" "Meeting" entry
             (file+olp+datetree "~/Projects/Code/emacs-from-scratch/OrgFiles/Journal.org")
             "* %<%I:%M %p> - %a :meetings:\n\n%?\n\n"
             :clock-in :clock-resume
             :empty-lines 1)

        ("w" "Workflows")
        ("m" "Metrics Capture")
        ))

    ;; Defining global keymap for entries in the capture (makes fast to access direct captures)
    (define-key global-map (kbd "C-c j")
      (lambda () (interactive) (org-capture nil "j")))

#+end_src

* Garbage collector
#+begin_src emacs-lisp
(setq gc-cons-threshold (* 2 1000 1000))
#+end_src
